```
Terraform Plan:
2020/11/13 06:30:28 [INFO] backend/local: plan operation completed

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # null_resource.MyNetWorkSecurityGroupList[0] will be created
  + resource "null_resource" "MyNetWorkSecurityGroupList" {
      + id       = (known after apply)
      + triggers = {
          + "id"   = "ocid1.networksecuritygroup.oc1.iad.aaaaaaaaurm3bfzkhqyrwnlzaxiojsy2pgnjpzi4x3crlbikmrtuzcljv3qa"
          + "name" = "testNetworkSecurityGroup"
        }
    }

  # null_resource.MyNetWorkSecurityGroupList[1] will be created
  + resource "null_resource" "MyNetWorkSecurityGroupList" {
      + id       = (known after apply)
      + triggers = {
          + "id"   = "ocid1.networksecuritygroup.oc1.iad.aaaaaaaa6omsush66ty342dqhj66vcmwk7tncgpfahdx75fou4ngvtr2pyeq"
          + "name" = "networksecuritygroup20201109155847"
        }
    }

  # null_resource.MyNetWorkSecurityGroupList[2] will be created
  + resource "null_resource" "MyNetWorkSecurityGroupList" {
      + id       = (known after apply)
      + triggers = {
          + "id"   = "ocid1.networksecuritygroup.oc1.iad.aaaaaaaa4c7fi4uexjxnjmatctp3bses4tg2yceogebwbzheyc6b46zz2mrq"
          + "name" = "networksecuritygroup20201001153005"
        }
    }

  # oci_core_network_security_group.test_network_security_group will be created
  + resource "oci_core_network_security_group" "test_network_security_group" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaayucukvyqljijj3nee76mqdi2t5lseddg4hrawtzmtyafeinvrulq"
      + defined_tags   = (known after apply)
      + display_name   = (known after apply)
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_vcn.test_vcn will be created
  + resource "oci_core_vcn" "test_vcn" {
      + cidr_block               = "10.0.0.0/16"
      + compartment_id           = "ocid1.compartment.oc1..aaaaaaaayucukvyqljijj3nee76mqdi2t5lseddg4hrawtzmtyafeinvrulq"
      + default_dhcp_options_id  = (known after apply)
      + default_route_table_id   = (known after apply)
      + default_security_list_id = (known after apply)
      + defined_tags             = (known after apply)
      + display_name             = (known after apply)
      + dns_label                = (known after apply)
      + freeform_tags            = (known after apply)
      + id                       = (known after apply)
      + ipv6cidr_block           = (known after apply)
      + ipv6public_cidr_block    = (known after apply)
      + is_ipv6enabled           = (known after apply)
      + state                    = (known after apply)
      + time_created             = (known after apply)
      + vcn_domain_name          = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

............
Terraform Apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

2020/11/13 06:30:43 [DEBUG] command: asking for input: "Do you want to perform these actions?"
  # null_resource.MyNetWorkSecurityGroupList[0] will be created
  + resource "null_resource" "MyNetWorkSecurityGroupList" {
      + id       = (known after apply)
      + triggers = {
          + "id"   = "ocid1.networksecuritygroup.oc1.iad.aaaaaaaaurm3bfzkhqyrwnlzaxiojsy2pgnjpzi4x3crlbikmrtuzcljv3qa"
          + "name" = "testNetworkSecurityGroup"
        }
    }

  # null_resource.MyNetWorkSecurityGroupList[1] will be created
  + resource "null_resource" "MyNetWorkSecurityGroupList" {
      + id       = (known after apply)
      + triggers = {
          + "id"   = "ocid1.networksecuritygroup.oc1.iad.aaaaaaaa6omsush66ty342dqhj66vcmwk7tncgpfahdx75fou4ngvtr2pyeq"
          + "name" = "networksecuritygroup20201109155847"
        }
    }

  # null_resource.MyNetWorkSecurityGroupList[2] will be created
  + resource "null_resource" "MyNetWorkSecurityGroupList" {
      + id       = (known after apply)
      + triggers = {
          + "id"   = "ocid1.networksecuritygroup.oc1.iad.aaaaaaaa4c7fi4uexjxnjmatctp3bses4tg2yceogebwbzheyc6b46zz2mrq"
          + "name" = "networksecuritygroup20201001153005"
        }
    }

  # oci_core_network_security_group.test_network_security_group will be created
  + resource "oci_core_network_security_group" "test_network_security_group" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaayucukvyqljijj3nee76mqdi2t5lseddg4hrawtzmtyafeinvrulq"
      + defined_tags   = (known after apply)
      + display_name   = (known after apply)
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_vcn.test_vcn will be created
  + resource "oci_core_vcn" "test_vcn" {
      + cidr_block               = "10.0.0.0/16"
      + compartment_id           = "ocid1.compartment.oc1..aaaaaaaayucukvyqljijj3nee76mqdi2t5lseddg4hrawtzmtyafeinvrulq"
      + default_dhcp_options_id  = (known after apply)
      + default_route_table_id   = (known after apply)
      + default_security_list_id = (known after apply)
      + defined_tags             = (known after apply)
      + display_name             = (known after apply)
      + dns_label                = (known after apply)
      + freeform_tags            = (known after apply)
      + id                       = (known after apply)
      + ipv6cidr_block           = (known after apply)
      + ipv6public_cidr_block    = (known after apply)
      + is_ipv6enabled           = (known after apply)
      + state                    = (known after apply)
      + time_created             = (known after apply)
      + vcn_domain_name          = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

.
.
.
.


2020-11-13T06:30:57.885-0800 [DEBUG] plugin: plugin exited

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

Outputs:

network-security-group-map = {
  "networksecuritygroup20201001153005" = "ocid1.networksecuritygroup.oc1.iad.aaaaaaaa4c7fi4uexjxnjmatctp3bses4tg2yceogebwbzheyc6b46zz2mrq"
  "networksecuritygroup20201109155847" = "ocid1.networksecuritygroup.oc1.iad.aaaaaaaa6omsush66ty342dqhj66vcmwk7tncgpfahdx75fou4ngvtr2pyeq"
  "testNetworkSecurityGroup" = "ocid1.networksecuritygroup.oc1.iad.aaaaaaaaurm3bfzkhqyrwnlzaxiojsy2pgnjpzi4x3crlbikmrtuzcljv3qa"
}

```

Weirdly enough pasting above got me this - in first try. 


```
$ tf12 version
2020/11/13 06:31:20 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
2020/11/13 06:31:20 [INFO] Terraform version: 0.12.29  
2020/11/13 06:31:20 [INFO] Go runtime version: go1.12.13
2020/11/13 06:31:20 [INFO] CLI args: []string{"/Users/srismish/TerraformVersion/Terraform12/tf12", "version"}
2020/11/13 06:31:20 [DEBUG] Attempting to open CLI config file: /Users/srismish/.terraformrc
2020/11/13 06:31:20 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2020/11/13 06:31:20 [DEBUG] checking for credentials in "/Users/srismish/.terraform.d/plugins"
2020/11/13 06:31:20 [DEBUG] checking for credentials in "/Users/srismish/.terraform.d/plugins/darwin_amd64"
2020/11/13 06:31:20 [INFO] CLI command args: []string{"version"}
Terraform v0.12.29
2020/11/13 06:31:20 [DEBUG] checking for provider in "."
2020/11/13 06:31:20 [DEBUG] checking for provider in "/Users/srismish/TerraformVersion/Terraform12"
2020/11/13 06:31:20 [DEBUG] checking for provider in ".terraform/plugins/darwin_amd64"
2020/11/13 06:31:20 [DEBUG] found provider "terraform-provider-null_v3.0.0_x5"
2020/11/13 06:31:20 [DEBUG] found provider "terraform-provider-oci_v4.2.0_x4"
2020/11/13 06:31:20 [DEBUG] checking for provider in "/Users/srismish/.terraform.d/plugins"
2020/11/13 06:31:20 [DEBUG] checking for provider in "/Users/srismish/.terraform.d/plugins/darwin_amd64"
2020/11/13 06:31:20 [DEBUG] found valid plugin: "null", "3.0.0", "/Users/srismish/projects/go/src/github.com/terraform-providers/terraform-provider-oci/examples/networking/network_security_group/.terraform/plugins/darwin_amd64/terraform-provider-null_v3.0.0_x5"
2020/11/13 06:31:20 [DEBUG] found valid plugin: "oci", "4.2.0", "/Users/srismish/projects/go/src/github.com/terraform-providers/terraform-provider-oci/examples/networking/network_security_group/.terraform/plugins/darwin_amd64/terraform-provider-oci_v4.2.0_x4"
+ provider.null v3.0.0
+ provider.oci v4.2.0
```